package data.jsontest;

import com.fasterxml.jackson.databind.JsonNode;
import com.fasterxml.jackson.databind.node.TextNode;
import com.github.kingschan1204.easycrawl.helper.datetime.DateHelper;
import com.github.kingschan1204.easycrawl.helper.json.JsonHelper;
import org.junit.jupiter.api.DisplayName;
import org.junit.jupiter.api.Test;

import java.util.*;
import java.util.function.Function;

@DisplayName("json operation test")
public class JsonTest {
    String jsonText = """
            {
              "symbol" : "SZ000981",
              "column" : [ "timestamp", "volume", "open", "high", "low", "close", "chg", "percent", "turnoverrate", "amount", "volume_post", "amount_post", "pe", "pb", "ps", "pcf" ],
              "item" : [ [ 1736092800000, 1123724093, 2.49, 2.49, 2.18, 2.25, -0.17, -7.02, 17.22, 2.597644905E9, null, null, -13.5584, 10.668, 4.4694, 37.8697 ], [ 1736179200000, 1302098258, 2.25, 2.48, 2.22, 2.48, 0.23, 10.22, 19.96, 3.165436497E9, null, null, -14.9444, 11.759, 4.9263, 41.7408 ], [ 1736265600000, 1346250837, 2.4, 2.63, 2.32, 2.54, 0.06, 2.42, 20.63, 3.285337001E9, null, null, -15.306, 12.043, 5.0454, 42.7507 ], [ 1736352000000, 782836876, 2.46, 2.57, 2.41, 2.43, -0.11, -4.33, 12.0, 1.933938631E9, null, null, -14.6431, 11.522, 4.8269, 40.8993 ], [ 1736438400000, 711449499, 2.37, 2.38, 2.2, 2.2, -0.23, -9.47, 10.9, 1.625921767E9, null, null, -13.2571, 10.431, 4.3701, 37.0281 ], [ 1736697600000, 555010069, 2.12, 2.33, 2.12, 2.25, 0.05, 2.27, 8.51, 1.242997194E9, null, null, -13.5584, 10.668, 4.4694, 37.8697 ], [ 1736784000000, 843992137, 2.22, 2.4, 2.15, 2.36, 0.11, 4.89, 12.93, 1.947120235E9, null, null, -14.2213, 11.19, 4.6879, 39.7211 ], [ 1736870400000, 598413689, 2.34, 2.37, 2.26, 2.29, -0.07, -2.97, 9.17, 1.375851753E9, null, null, -13.7995, 10.858, 4.5488, 38.5429 ], [ 1736956800000, 1262302315, 2.29, 2.52, 2.28, 2.48, 0.19, 8.3, 19.35, 3.119219118E9, null, null, -14.9444, 11.759, 4.9263, 41.7408 ], [ 1737043200000, 769126778, 2.42, 2.46, 2.32, 2.36, -0.12, -4.84, 11.79, 1.814271117E9, null, null, -14.2213, 11.19, 4.6879, 39.7211 ], [ 1737302400000, 556998799, 2.42, 2.45, 2.31, 2.33, -0.03, -1.27, 8.54, 1.316727875E9, null, null, -14.0405, 11.048, 4.6283, 39.2162 ], [ 1737388800000, 487006959, 2.37, 2.37, 2.22, 2.29, -0.04, -1.72, 7.46, 1.1054641E9, null, null, -13.7995, 10.858, 4.5488, 38.5429 ], [ 1737475200000, 283420090, 2.26, 2.28, 2.21, 2.23, -0.06, -2.62, 4.34, 6.33817911E8, null, null, -13.4379, 10.573, 4.4297, 37.5331 ], [ 1737561600000, 368500964, 2.25, 2.29, 2.2, 2.2, -0.03, -1.35, 5.65, 8.24296342E8, null, null, -13.2571, 10.431, 4.3701, 37.0281 ], [ 1737648000000, 356207345, 2.18, 2.2, 2.12, 2.16, -0.04, -1.82, 5.46, 7.66749062E8, null, null, -13.0161, 10.242, 4.2906, 36.3549 ], [ 1737907200000, 378488546, 2.05, 2.11, 2.02, 2.03, -0.13, -6.02, 5.8, 7.76262796E8, null, null, -12.2327, 9.625, 4.0324, 34.1669 ], [ 1738684800000, 505389669, 2.05, 2.23, 2.03, 2.17, 0.14, 6.9, 7.75, 1.064695888E9, null, null, -13.0764, 10.289, 4.3105, 36.5232 ], [ 1738771200000, 432199847, 2.13, 2.17, 2.09, 2.16, -0.01, -0.46, 6.62, 9.20638428E8, null, null, -13.0161, 10.242, 4.2906, 36.3549 ], [ 1738857600000, 822186552, 2.17, 2.35, 2.16, 2.28, 0.12, 5.56, 12.6, 1.858063009E9, null, null, -13.7392, 10.811, 4.529, 38.3746 ], [ 1739116800000, 723732308, 2.25, 2.33, 2.22, 2.32, 0.04, 1.75, 11.09, 1.659310578E9, null, null, -13.9803, 11.0, 4.6084, 39.0478 ], [ 1739203200000, 529368720, 2.33, 2.35, 2.24, 2.28, -0.04, -1.72, 8.11, 1.208791799E9, null, null, -13.7392, 10.811, 4.529, 38.3746 ], [ 1739289600000, 543144674, 2.26, 2.38, 2.24, 2.3, 0.02, 0.88, 8.32, 1.253970188E9, null, null, -13.8597, 10.905, 4.5687, 38.7112 ], [ 1739376000000, 660379886, 2.29, 2.38, 2.27, 2.32, 0.02, 0.87, 10.12, 1.53905342E9, null, null, -13.9803, 11.0, 4.6084, 39.0478 ], [ 1739462400000, 579385577, 2.3, 2.3, 2.19, 2.2, -0.12, -5.17, 8.88, 1.286756627E9, null, null, -13.2571, 10.431, 4.3701, 37.0281 ], [ 1739721600000, 504781182, 2.16, 2.29, 2.16, 2.25, 0.05, 2.27, 7.74, 1.125725908E9, null, null, -13.5584, 10.668, 4.4694, 37.8697 ], [ 1739808000000, 456778800, 2.24, 2.24, 2.14, 2.14, -0.11, -4.89, 7.0, 9.92620061E8, null, null, -12.8956, 10.147, 4.2509, 36.0183 ], [ 1739894400000, 355351956, 2.14, 2.22, 2.13, 2.18, 0.04, 1.87, 5.45, 7.72321044E8, null, null, -13.1366, 10.336, 4.3303, 36.6915 ], [ 1739980800000, 467256817, 2.17, 2.25, 2.14, 2.21, 0.03, 1.38, 7.16, 1.021015661E9, null, null, -13.3174, 10.479, 4.3899, 37.1964 ], [ 1740067200000, 402770429, 2.19, 2.19, 2.13, 2.17, -0.04, -1.81, 6.17, 8.71042448E8, null, null, -13.0764, 10.289, 4.3105, 36.5232 ], [ 1740326400000, 511663275, 2.16, 2.27, 2.15, 2.19, 0.02, 0.92, 7.84, 1.127980278E9, null, null, -13.1969, 10.384, 4.3502, 36.8598 ] ]
            }
            """;

    @Test
    public void transformation() {
        JsonHelper jsonHelper = JsonHelper.of(jsonText);
//        System.out.println(jsonHelper.op("column").pretty());
//        System.out.println(jsonHelper.op("item").pretty());
       /* // 解析JSON字符串
        JsonNode rootNode = jsonHelper.root();

        // 输出每个属性和值
        rootNode.fieldNames().forEachRemaining(fieldName -> {
            JsonNode fieldValue = rootNode.get(fieldName);
            System.out.println(fieldName + ": " + fieldValue.toString());
        });*/
        List<String> heads = jsonHelper.op("column").toListObj(String.class);
        System.out.println(heads);

        List<List> values = jsonHelper.op("item").toListObj(List.class);
        System.out.println(values);

        //字段转换 - 将字段数据转换的逻辑可以抽象出来
        Map<String, Function<Object, Object>> fieldMaping = new HashMap<>();
        fieldMaping.put("timestamp", val -> DateHelper.of(val).format("yyyyMMdd"));

        Map<String, Object> row;
        for (int i = 0; i < values.size(); i++) {
            row = new LinkedHashMap<>();
            for (int j = 0; j < heads.size(); j++) {
                String key = heads.get(j);
                Object val = values.get(i).get(j);
                if (fieldMaping.containsKey(key)) {
                    row.put(key, fieldMaping.get(key).apply(val));
                } else {
                    row.put(key, val);
                }
            }
            System.out.println(row);
        }
    }

}
